mediaMicroservices/wrk2/oneone_60s_r25.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 116.356ms, rate sampling interval: 318ms
  Thread calibration: mean lat.: 128.428ms, rate sampling interval: 396ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.74s     1.66s    5.92s    76.55%
    Req/Sec    10.93      6.46    28.00     75.27%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.52s 
 75.000%    2.88s 
 90.000%    4.17s 
 99.000%    5.92s 
 99.900%    7.82s 
 99.990%    8.07s 
 99.999%    8.07s 
100.000%    8.07s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      58.847     0.000000            1         1.00
      90.175     0.100000          114         1.11
     106.431     0.200000          227         1.25
     158.335     0.300000          339         1.43
     707.071     0.400000          452         1.67
    1517.567     0.500000          565         2.00
    1744.895     0.550000          622         2.22
    1979.391     0.600000          678         2.50
    2236.415     0.650000          735         2.86
    2533.375     0.700000          791         3.33
    2883.583     0.750000          848         4.00
    3061.759     0.775000          876         4.44
    3213.311     0.800000          904         5.00
    3436.543     0.825000          933         5.71
    3647.487     0.850000          961         6.67
    3952.639     0.875000          990         8.00
    4069.375     0.887500         1003         8.89
    4165.631     0.900000         1017        10.00
    4304.895     0.912500         1032        11.43
    4534.271     0.925000         1046        13.33
    4665.343     0.937500         1060        16.00
    4734.975     0.943750         1068        17.78
    4808.703     0.950000         1074        20.00
    4907.007     0.956250         1081        22.86
    5009.407     0.962500         1088        26.67
    5255.167     0.968750         1095        32.00
    5320.703     0.971875         1099        35.56
    5382.143     0.975000         1102        40.00
    5492.735     0.978125         1106        45.71
    5607.423     0.981250         1109        53.33
    5660.671     0.984375         1113        64.00
    5758.975     0.985938         1115        71.11
    5804.031     0.987500         1116        80.00
    5844.991     0.989062         1118        91.43
    6033.407     0.990625         1120       106.67
    6361.087     0.992188         1122       128.00
    6651.903     0.992969         1123       142.22
    6651.903     0.993750         1123       160.00
    6701.055     0.994531         1124       182.86
    6737.919     0.995313         1125       213.33
    6828.031     0.996094         1126       256.00
    7389.183     0.996484         1127       284.44
    7389.183     0.996875         1127       320.00
    7389.183     0.997266         1127       365.71
    7753.727     0.997656         1128       426.67
    7753.727     0.998047         1128       512.00
    7815.167     0.998242         1129       568.89
    7815.167     0.998437         1129       640.00
    7815.167     0.998633         1129       731.43
    7815.167     0.998828         1129       853.33
    7815.167     0.999023         1129      1024.00
    8073.215     0.999121         1130      1137.78
    8073.215     1.000000         1130          inf
#[Mean    =     1741.243, StdDeviation   =     1660.110]
#[Max     =     8069.120, Total count    =         1130]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1392 requests in 1.00m, 253.33KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
  Non-2xx or 3xx responses: 19
Requests/sec:     23.20
Transfer/sec:      4.22KB