mediaMicroservices/wrk2/oneone_60s_r75.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 987.250ms, rate sampling interval: 3631ms
  Thread calibration: mean lat.: 1108.688ms, rate sampling interval: 4440ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    10.55s     4.77s   20.97s    60.42%
    Req/Sec    23.50      6.68    31.00     83.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.62s 
 75.000%   13.37s 
 90.000%   17.53s 
 99.000%   20.97s 
 99.900%   23.12s 
 99.990%   23.31s 
 99.999%   23.31s 
100.000%   23.31s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1200.127     0.000000            1         1.00
    3710.975     0.100000          242         1.11
    5378.047     0.200000          484         1.25
    8724.479     0.300000          727         1.43
    9838.591     0.400000          969         1.67
   10616.831     0.500000         1209         2.00
   10903.551     0.550000         1334         2.22
   11370.495     0.600000         1451         2.50
   11943.935     0.650000         1572         2.86
   12599.295     0.700000         1693         3.33
   13369.343     0.750000         1814         4.00
   14114.815     0.775000         1874         4.44
   14835.711     0.800000         1935         5.00
   15351.807     0.825000         1995         5.71
   15982.591     0.850000         2056         6.67
   17072.127     0.875000         2117         8.00
   17317.887     0.887500         2147         8.89
   17563.647     0.900000         2179        10.00
   17776.639     0.912500         2209        11.43
   17924.095     0.925000         2237        13.33
   18137.087     0.937500         2267        16.00
   18382.847     0.943750         2282        17.78
   18661.375     0.950000         2298        20.00
   18808.831     0.956250         2316        22.86
   18890.751     0.962500         2329        26.67
   19021.823     0.968750         2343        32.00
   19136.511     0.971875         2350        35.56
   19202.047     0.975000         2358        40.00
   19300.351     0.978125         2366        45.71
   19431.423     0.981250         2373        53.33
   20660.223     0.984375         2381        64.00
   20807.679     0.985938         2386        71.11
   20889.599     0.987500         2388        80.00
   20955.135     0.989062         2392        91.43
   21118.975     0.990625         2398       106.67
   21184.511     0.992188         2400       128.00
   21250.047     0.992969         2401       142.22
   21561.343     0.993750         2404       160.00
   21577.727     0.994531         2405       182.86
   21823.487     0.995313         2407       213.33
   21954.559     0.996094         2409       256.00
   22003.711     0.996484         2410       284.44
   22200.319     0.996875         2411       320.00
   22265.855     0.997266         2412       365.71
   22380.543     0.997656         2413       426.67
   22888.447     0.998047         2414       512.00
   22888.447     0.998242         2414       568.89
   23035.903     0.998437         2415       640.00
   23035.903     0.998633         2415       731.43
   23117.823     0.998828         2416       853.33
   23117.823     0.999023         2416      1024.00
   23117.823     0.999121         2416      1137.78
   23281.663     0.999219         2417      1280.00
   23281.663     0.999316         2417      1462.86
   23281.663     0.999414         2417      1706.67
   23281.663     0.999512         2417      2048.00
   23281.663     0.999561         2417      2275.56
   23314.431     0.999609         2418      2560.00
   23314.431     1.000000         2418          inf
#[Mean    =    10549.934, StdDeviation   =     4768.573]
#[Max     =    23298.048, Total count    =         2418]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3054 requests in 1.00m, 559.07KB read
  Non-2xx or 3xx responses: 61
Requests/sec:     50.89
Transfer/sec:      9.32KB